app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "password_digest", "nausea", "happiness", "tickets", "height", "admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)